package by.mozolevskij.pharmacy.example.pattern.structural.proxy;

public class ProxyExample {

    /**
     *
     * Proxy - структурный паттерн, позволяет вместо реальных объектов
     * подставляить объекты заменители, (уполнимоченный), дают
     * возможность сделать что-то до или после передачи оригиналу
     *
     * Примеры:
     * Ленивая инициализация, вместо немедоленной загрузки данных
     * можно подождать когда данные действительно понадобятся
     *
     * Защита доступа, прокси может проверяить доступ при каждом вызове
     * закрывать доступ неаутентифицированным пользователям
     *
     * */

}
